Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 16)                80        
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 34        
=================================================================
Total params: 114
Trainable params: 114
Non-trainable params: 0
_________________________________________________________________
